Repository: YazeedAlKhalaf/alyamamah
Catalog: mobile/lib/l10n/*.arb
Languages: ar

source: Login
ar: تسجيل دخول

# username
source: University ID
ar: الرقم الجامعي

source: Password
ar: كلمة المرور

source: Unknown service error
ar: خطأ خدمة غير معروف

# invalid_credentials
source: The university ID or password is wrong
ar: الرقم الجامعي أو كلمة المرور خاطئة

source: Home
ar: الرئيسية

source: Profile
ar: الملف الشخصي

source: Appearance
ar: المظهر

source: Theme
ar: النسق

source: Light
ar: فاتح

source: Dark
ar: داكن

source: System
ar: النظام

source: About us
ar: عنا

source: Rate us on the {store}
ar: قيمنا على {store}

source: App Store
ar: أبل ستور

source: Play Store
ar: متجر بلاي

source: Follow us on Twitter
ar: تابعنا على تويتر

source: Logout
ar: تسجيل خروج

source: Language
ar: اللغة

source: Unknown
ar: غير معروف

source: Student Information
ar: معلومات الطالب

source: Mobile
ar: الجوال

source: Email
ar: البريد الإلكتروني

source: Degree
ar: الدرجة

source: Campus
ar: المقر

source: Faculty
ar: الكلية

source: Major
ar: التخصص

source: Study Type
ar: نوع الدراسة

source: Status
ar: الحالة

source: Sunday
ar: الأحد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الإربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: Saturday
ar: السبت

source: Sun
ar: الأحد

source: Mon
ar: الإثنين

source: Tue
ar: الثلاثاء

source: Wed
ar: الإربعاء

source: Thu
ar: الخميس

source: Fri
ar: الجمعة

source: Sat
ar: السبت

source: My Courses
ar: مقرراتي

source: Session expired
ar: انتهت الجلسة

# break_word
source: Break
ar: فسحة

# welcome_to_alyamamah
source: Welcome in Al Yamamah
ar: حياك الله في اليمامة

source: Absences
ar: الغيابات

source: Absences: {count}
ar: الغيابات: {count}

# absence_details
source: Absences details
ar: تفاصيل الغيابات

source: Excused
ar: معذور

source: Late
ar: متأخر

source: No absences
ar: لا يوجد غيابات

source: University ID is required
ar: الرقم الجامعي مطلوب

source: Password is required
ar: كلمة المرور مطلوبة

source: Collapse
ar: أغلق

source: Lates: {count}
ar: التأخيرات: {count}

# no_absences_description
source: Keep up the good work and try to never miss a class!
ar: كفو عليك، خليك كذا ولا تغيب على أي محاضرة!

source: Course Code
ar: رمز المقرر

source: Room
ar: القاعة

source: Activity Description
ar: وصف النشاط

source: Instructor
ar: المدرس

source: Credit Hours
ar: عدد الساعات

source: Campus Name
ar: اسم المقر

# course_deleted_q
source: Course Deleted?
ar: المقرر محذوف؟

source: Yes
ar: نعم

source: No
ar: لا

source: Section
ar: شعبة

source: Regular
ar: عادي

source: Ramadan
ar: رمضان

source: Choose Semester
ar: اختر الفصل الدراسي

# choose_semester_description
source: This shows all the semester since you have joined the university.
ar: هنا تعرض جميع الفصول الدراسية منذ انضمامك إلى الجامعة.

source: current
ar: الحالي

source: previous
ar: السابق

source: Edit
ar: تعديل

source: Update Mobile
ar: تحديث الجوال

source: Update
ar: تحديث

source: Update Email
ar: تحديث البريد الإلكتروني

# enter_your_email
source: Please enter your email
ar: رجاء أدخل بريدك الإلكتروني

# enter_valid_email
source: Please enter a valid email
ar: رجاء أدخل بريد إلكتروني صحيح

# enter_your_mobile
source: Please enter your mobile
ar: رجاء أدخل جوالك

# enter_valid_mobile
source: Please enter a valid mobile
ar: رجاء أدخل رقم جوال صحيح

source: Semester Progress tool
ar: أداة تقدم الفصل الدراسي

source: Tuwaiq Rooms tool
ar: أداة القاعات التعليمية في طويق

source: PM
ar: ص

source: AM
ar: م

source: Manage Link
ar: إدارة الرابط

# manage_link_description
source: This link provides convenient access to the e.g. Zoom meeting for your class
ar: هذا الرابط يوفر لك الوصول السهل إلى مثلاً اجتماع زووم الخاص بفصلك الدراسي.

source: Delete
ar: حذف

source: Link
ar: الرابط

source: Link cannot be empty
ar: لا يمكن أن يكون الرابط فارغاً

# enter_a_valid_link
source: Please enter a valid link
ar: رجاء أدخل رابطاً صحيحاً

source: Set
ar: تعيين

source: Click here to open the link
ar: اضغط هنا لفتح الرابط

source: Click 'Set' to define the link
ar: اضغط 'تعيين' لتحديد الرابط

source: Delete Link
ar: حذف الرابط

# you_sure_delete_link
source: Are you sure you want to delete this link?
ar: هل أنت متأكد من أنك تريد حذف هذا الرابط؟

source: Failed to open link 😢
ar: فشل في فتح الرابط 😢

source: GPA
ar: المعدل

# alyamamah_gpt_description
source: Unlocks unlimited messages to AlYamamahGPT
ar: يفتح عدد غير محدود من الرسائل إلى AlYamamahGPT

source: Current Packages
ar: الباقات الحالية

source: Lifetime
ar: مدى الحياة

# annual
source: Annually
ar: سنوي

# six_month
source: 6 Months
ar: 6 أشهر

# three_month
source: 3 Months
ar: 3 أشهر

# two_month
source: 2 Months
ar: 2 أشهر

source: Monthly
ar: شهري

source: Weekly
ar: أسبوعي

source: You need to subscribe first 😁
ar: يجب عليك الإشتراك أولاً 😁

# active_with_emoji
source: Active ✅
ar: ✅ نشطة

source: Ask AlYamamahGPT
ar: اسأل AlYamamahGPT

# new_word
source: New
ar: جديد

source: Type your message here
ar: اكتب رسالتك هنا

source: Human
ar: بشري

source: AI
ar: ذكاء اصطناعي

source: Invalid Request
ar: طلب غير صالح

source: Payment Required
ar: مطلوب الدفع

source: Purchase has been cancelled
ar: ألغي الشراء

# purchase_invalid
source: Purchase is invalid
ar: عملية الشراء غير صالحة

# purchase_not_allowed
source: Purchase is not allowed
ar: عملية الشراء غير مسموح بها

# purchase_pending
source: Purchase is pending
ar: عملية الشراء معلقة

source: We couldn't find any offerings for you
ar: لم نتمكن من العثور على أي عروض لك 😢

source: Restore
ar: استعادة

# too_many_requests
source: You have reached the limit of requests. Please try again later.
ar: وصلت العدد الأقصى للطلبات. رجاء حاول مرة أخرى لاحقاً.

# gpt_4_limits_message
source: GPT-4 currently has a cap of 25 messages every 3 hours.
ar: GPT-4 حاليا يحد من الرسائل إلى 25 رسالة كل 3 ساعات.

# user_is_generating
source: Only one concurrent generation is allowed per user, wait for the current generation to finish.
ar: يمكنك توليد رسالة واحدة فقط بالتزامن، انتظر التوليدة الأخيرة إلى أن تنتهي.

source: Your best companion for school work!
ar: أفضل رفيق لك للعمل المدرسي!

# context_length_exceeded
source: Your chat is too long for this model's context, start a new chat.
ar: المحادثة الخاصة بك طويلة جداً بالنسبة لسياق هذا النموذج، ابدأ محادثة جديدة.

source: First Semester ({year1}/{year2})
ar: الفصل الأول ({year1}/{year2})

source: Second Semester ({year1}/{year2})
ar: الفصل الثاني ({year1}/{year2})

source: Summer Semester ({year1}/{year2})
ar: الفصل الصيفي ({year1}/{year2})

source: This semester has no courses yet
ar: لا يوجد مقررات لهذا الفصل الدراسي بعد

source: Join Semester
ar: فصل الانضمام

source: Finished restoring successfully
ar: تمت الاستعادة بنجاح

# something_went_wrong_restoring_try_again
source: Something went wrong while restoring, please try again
ar: حدث خطأ أثناء الاستعادة، حاول مرة أخرى

source: Grades
ar: الدرجات

source: The grades of this semester are not available yet
ar: درجات هذا الفصل الدراسي غير متوفرة بعد

# something_went_wrong_fetching_grades_for_this_semester
source: Something went wrong while fetching grades for this semester
ar: حدث خطأ أثناء جلب الدرجات لهذا الفصل الدراسي

source: Semester GPA
ar: معدل الفصل

source: Cumulative GPA
ar: المعدل التراكمي

source: No student GPA returned
ar: معدل الطالب لم يرجع

source: Unlock a world of instant updates! 🌟
ar: افتح عالماً من التحديثات الفورية 🌟

source: Don't miss a beat, enable notifications. We promise only to ping when it's worth your while.
ar: لا تفوت لحظة، فعّل الإشعارات. نوعدك بأننا سنرسل لك إشعاراً فقط عندما يكون الأمر يستحق العناء.

source: Allow Notifications
ar: فعّل الإشعارات

source: Skip for Now
ar: ليس الآن

source: Notifications
ar: الإشعارات

source: Privacy Policy
ar: سياسة الخصوصية

source: Terms of Use
ar: شروط الاستخدام

source: Build My Schedule
ar: أنشئ جدولي

source: Offered Courses
ar: المقررات المتاحة

source: Schedule Builder
ar: منشئ الجدول

# something_went_wrong_fetching_your_offered_courses
source: Something went wrong while fetching your offered courses
ar: حدث خطأ أثناء جلب المقررات المتاحة لك

source: Please try again
ar: حاول مرة أخرى

source: No offered courses found
ar: لم يعثر على مقررات متاحة

source: Wait till the university releases the courses or talk to your advisor
ar: انتظر حتى تصدر الجامعة المقررات أو تحدث مع مستشارك

# min_x
source: Min {hours}
ar: الحد الأدنى {hours}

# max_x
source: Max {hours}
ar: الحد الأعلى {hours}

# attempted_x
source: Attempted {hours}
ar: المحجوزة {hours}

# selected_x
source: Selected {hours}
ar: المحددة {hours}

source: Next
ar: التالي

source: Choose Schedule
ar: اختر الجدول

source: Schedule has conflicts
ar: الجدول يحتوي على تعارضات

source: Remove Course
ar: إزالة المقرر

source: You have to pay before saving this schedule
ar: يجب عليك الدفع قبل حفظ هذا الجدول

source: Open Payment Link
ar: افتح رابط الدفع

# previous_credit_x
source: 📚 Previous Credit: {amount}
ar: 📚 الرصيد السابق: {amount}

# semester_fees_x
source: 💵 Semester Fees: {amount}
ar: 💵 رسوم الفصل الدراسي: {amount}

# total_x
source: 💼 Total: {amount}
ar: 💼 الإجمالي: {amount}

source: By tapping the above button, you'll pay your fees securely on the university's site.
ar: بالضغط على الزر أعلاه، ستدفع رسومك بشكل آمن على موقع الجامعة

source: Oops! It looks like there's a problem with your payment. Please confirm your payment information and try again.
ar: عفواً، يبدو أن هناك مشكلة في عملية الدفع، يرجى التأكد من معلومات الدفع والمحاولة مرة أخرى

source: Your schedule has been set successfully. You can view it in the courses tab.
ar: عيّن جدولك بنجاح، يمكنك الإطلاع في صفحة المقررات

source: Chats
ar: المحادثات

# something_went_wrong_fetching_your_chats
source: Something went wrong while fetching your chats
ar: حدث خطأ أثناء جلب المحادثات الخاصة بك

source: No chats
ar: لا يوجد محادثات

# no_chats_description
source: No chats yet, those are linked to your courses
ar: لا يوجد محادثات لعرضها، هي مرتبطة بالمقررات التي تدرسها

source: Syncing chats
ar: جاري مزامنة المحادثات

source: Loading chats
ar: جاري تحميل المحادثات

source: Get Chats
ar: احصل على المحادثات

source: All the courses that you have selected have conflicts. Please remove some courses and try again.
ar: جميع المقررات التي اخترتها تحتوي على تعارضات، رجاء أزل بعض المقررات وحاول مرة أخرى

source: Go Back
ar: عودة

source: Temporary Maintenance
ar: صيانة مؤقتة

# temporary_maintenance_description
source: The app is currently undergoing maintenance to enhance your experience. I'm working hard to bring it back up. Thank you for your patience and understanding.
ar: التطبيق يخضع حاليًا لأعمال صيانة لتحسين تجربتك. أنا أعمل بجهد لإعادته للعمل. شكرًا لصبرك وتفهمك.

source: For any concerns or feedback, feel free to reach out:
ar: لأي استفسارات أو تعليقات، لا تتردد في التواصل:

source: Email: {x}
ar: البريد الإلكتروني: {x}

source: Failed to launch email app.
ar: فشل في قتح تطبيق البريد الإلكتروني.

source: Twitter DM
ar: رسالة عبر تويتر

source: Failed to launch Twitter app.
ar: فشل في فتح تطبيق تويتر.

source: Feedback for Student Council
ar: ملاحظات للمجلس الطلّابي

source: Voice Your Concerns!
ar: أعرب عن مخاوفك!

source: Title
ar: العنوان

source: Category
ar: التصنيف

source: Body
ar: الموضوع

source: Send
ar: أرسل

source: Failed to load feedback categories
ar: فشل في تحميل التصنيفات

source: Please enter a title
ar: رجاء أدخل عنواناً

# title_must_be_at_least_three_characters
source: Title must be at least 3 characters
ar: يجب أن يكون العنوان على الأقل 3 أحرف

# title_must_be_at_most_one_hundred_characters
source: Title must be at most 100 characters
ar: يجب أن يكون العنوان على الأكثر 100 حرف

source: Please select a category
ar: رجاد اختر تصنيفاً

source: Please enter a body
ar: رجاء أدخل موضوعاً

# body_must_be_at_least_ten_characters
source: Body must be at least 10 characters
ar: يجب أن يكون الموضوع على الأقل 10 أحرف

# body_must_be_at_most_one_thousand_characters
source: Body must be at most 1,000 characters
ar: يجب أن يكون الموضوع على الأكثر 1,000 حرف

source: Failed to send feedback
ar: فشل إرسال الملاحظات

source: Feedback sent successfully
ar: أرسلت الملاحظات بنجاح

source: Share my contact information
ar: شارك معلومات التواصل الخاصة بي

source: Feedbacks
ar: الملاحظات

source: Error loading feedbacks
ar: خطأ في تحميل الملاحظات

source: Create Feedback
ar: أنشئ ملاحظة

source: Share concerns with the Student Council
ar: شارك المخاوف مع المجلس الطلابي

source: Finals
ar: النهائي

source: Something Went Wrong
ar: حدث خطأ

source: Failed to load finals
ar: فشل في تحميل مواعيد الاختبارات النهائية
